{
  "Tuta Absoluta": {
    "description": "Tuta absoluta, or the tomato borer, is an invasive moth native to South America, notorious for its damage to tomato crops and other nightshades. Its larvae, which are green or pink, burrow into leaves, stems, and fruits, causing necrosis and significant crop losses. With a rapid life cycle (up to 12 generations per year), this pest easily adapts to various climates, making its management complex. Its economic and ecological impact makes it a major threat to gardeners and farmers.",
    "symptoms": "The symptoms of Tuta absoluta are often confused with diseases or deficiencies, but a few distinctive signs can help identify it. On the leaves, look for small winding tunnels, white or transparent spots (galleries dug by the larvae), and rapidly spreading necrotic areas. The stems may have perforations or signs of mining under the bark. Affected fruits show superficial holes, internal galleries (sometimes invisible from the outside), and accelerated rotting due to opportunistic bacteria. Another clue is the presence of small gray moths (1 cm wingspan) at dusk, or pale green to pink larvae (5 to 8 mm) on the foliage. Black droppings (larvae excrement) around the damaged areas are also a telltale sign. Act quickly: an uncontrolled infestation can destroy a harvest in a few weeks. Tip: Regularly inspect the undersides of the leaves, where eggs (tiny and yellowish) and young larvae often hide.",
    "prevention": "Prevention is essential to limit the damage caused by Tuta absoluta. Start by regularly inspecting your plants, especially under the leaves, to detect the first signs of infestation. Use insect-proof nets (fine mesh) to prevent moths from laying eggs on your crops. Pair your tomatoes with repellent plants like basil, marigold, or mint, which disrupt pests. Practice crop rotation: avoid planting nightshades (tomatoes, eggplants, potatoes) in the same spot for two consecutive years. Destroy crop residues after harvest to eliminate overwintering larvae. Finally, set up pheromone traps to capture adults before they lay eggs. These methods significantly reduce the risk of infestation without resorting to pesticides.",
    "treatment": "At the first signs of an attack, act quickly to limit the spread. Manually remove and destroy infested leaves and fruits (burn them or place them in a sealed bag) to eliminate larvae and eggs. Introduce natural predators like macrobiota (small parasitic wasps) or predatory bugs (Nesidiocoris tenuis), available at garden centers, which specifically target the larvae. For small areas, a treatment with black soap or neem oil (natural insecticide) can reduce populations; apply in the evening to avoid harming pollinators. In cases of severe infestation, biological products based on Bacillus thuringiensis (a bacterium targeting caterpillars) are effective. Avoid chemical insecticides, as they promote resistance and disrupt the ecosystem. Repeat treatments every 7 to 10 days, alternating methods for better effectiveness."
  },
  "Botrytis": {
    "description": "Botrytis cinerea is a ubiquitous fungus responsible for gray mold, feared for its impact on tomatoes and many other crops. It thrives in humid and poorly ventilated environments, attacking leaves, stems, and fruits. Its spores, carried by wind or water, germinate quickly on weakened or damaged plant tissues. This pathogen survives for a long time in the soil and plant debris, making its management difficult without active prevention.",
    "symptoms": "The first signs often appear on older leaves or ripe fruits: brown, soft spots covered with a characteristic grayish fuzz (the fungus's mycelium). Stems may also show black, dry lesions, while infected fruits rot quickly, becoming covered with gray mold. In humid conditions, the disease progresses rapidly, forming concentric circles of rot. Another clue is withered flowers that remain attached to the plants, often colonized by Botrytis. Be careful: this fungus also attacks wounds (pruning, hail damage) and fruits in contact with the soil. Regularly inspect your plants, especially after rain or excessive watering, and immediately remove affected parts to limit the spread.",
    "prevention": "The key is to reduce humidity and improve air circulation. Space your plants (at least 50 cm apart) and trim the lower leaves to aerate the foliage. Water at the base, early in the morning, avoiding wetting the leaves. Use mulch to limit soil splashes on the fruits. Disinfect your tools and greenhouses between crops, and remove plant debris (dead leaves, fallen fruits) where the fungus overwinters. Favor resistant varieties and avoid excess nitrogen, which makes plants more susceptible. Finally, in greenhouses, proper ventilation and moderate heating reduce risks.",
    "treatment": "At the first signs of symptoms, remove and burn the infected parts (do not compost them!). For small areas, a solution of baking soda (1 tablespoon per liter of water + a few drops of soap) as a preventive spray can slow the progression. Horsetail extract or skim milk (diluted to 10%) also has a fungistatic effect. In cases of advanced infestation, biological fungicides based on Bacillus subtilis or Trichoderma (available at garden centers) are effective. Avoid chemical fungicides in amateur gardening, especially during harvest time. Repeat treatments every 7 to 10 days, especially in humid weather. After harvesting, disinfect the soil with a biofungicide or through solarization (using a black tarp in summer)."
  },
  "Puceron Cendré": {
    "description": "The green peach aphid is a sap-sucking insect, recognizable by its green or grayish color and its size (2–3 mm). It is polyphagous, primarily attacking tomatoes but also potatoes, eggplants, and ornamental plants. It reproduces rapidly through parthenogenesis (without males), forming dense colonies on young shoots and the undersides of leaves. This pest weakens plants and transmits viruses (such as the mosaic virus).",
    "symptoms": "The first signs are colonies of small green or gray insects clustered on young shoots, flower buds, or the undersides of leaves. Affected leaves become deformed, yellow, or curl downward. Stems and fruits may become covered with a sticky substance (honeydew), promoting the appearance of sooty mold (a blackish fungus). Also, watch for ants around the plants: they protect the aphids to collect their honeydew. Infested tomatoes show stunted growth and deformed fruits. In cases of severe infestation, the plants quickly decline. Regularly inspect the tender parts of the plant, where aphids hide.",
    "prevention": "Encourage biodiversity by planting natural repellents (marigolds, nasturtiums, lavender) near tomatoes. Introduce natural predators like ladybugs, hoverflies, or lacewings, which are natural enemies of aphids. Use insect-proof nets on young plants to prevent their establishment. Avoid excess nitrogen, which stimulates the growth of tender shoots that are attractive to aphids. Water at the base to avoid promoting their spread. Lastly, keep an eye on ants: if you see them, they often indicate the presence of aphids.",
    "treatment": "For small colonies, crush the aphids manually or use a water jet to dislodge them. Black soap (20 g/L) or neem oil (sprayed in the evening) are effective and environmentally friendly. Fermented nettle extract acts as a repellent and strengthens the plants. In cases of severe infestation, introduce ladybug larvae or lacewings (chrysopids), available at garden centers. Avoid chemical insecticides, which also kill beneficial insects and promote resistance. Repeat treatments every 5–7 days, alternating methods to prevent habituation. After harvesting, destroy crop residues to eliminate overwintering eggs."
  },
  "Punaise Nesidiocoris": {
    "description": "Nesidiocoris tenuis is a small bug (2–3 mm) native to Europe, a natural predator of many pests (whiteflies, aphids, lepidopteran eggs). Introduced for biological control, it can also become a problem by piercing tomato fruits, causing necrotic spots and deformities. Its elongated body, slender legs, and green or brown color distinguish it from other bugs.",
    "symptoms": "Unlike traditional pests, this bug does not suck the sap from leaves but pierces the fruits (especially cherry tomatoes) to feed. The symptoms are small black or brown spots (necroses) on the surface of the fruits, often surrounded by a yellow halo. Repeated punctures cause deformities, cracks, or localized hardening of the skin. The leaves may also show tiny yellow spots (feeding punctures), but without major deformation. Do not confuse this with damage from thrips or mites! To confirm its presence, look for adult bugs or their larvae (transparent to pale green) on the foliage or flowers.",
    "prevention": "If you use this bug as a biological control agent, introduce it early in the season (before the fruits appear) so that it feeds on pests first. Avoid large releases in greenhouses or sheltered areas, where it can proliferate due to a lack of alternative prey. To reduce damage to fruits: (i) Combine it with other predators (like Macrolophus pygmaeus), which help limit its population. (ii) Monitor the first fruits: if punctures appear, reduce the introduction of beneficials. (iii) Favor less sensitive tomato varieties (with thick skin).",
    "treatment": "If Nesidiocoris becomes problematic: (i) Reduce the releases of beneficials and introduce specific predators (like Dicyphus hesperus), which help regulate its population. (ii) Manually remove adult bugs and larvae by shaking the plants over a white cloth in the morning (they are less mobile at low temperatures). (iii) Set up yellow sticky traps to capture adults. Avoid chemical insecticides: they also kill beneficials and worsen imbalances. As a last resort, use insecticidal soaps or neem oil (targeted spraying in the evening). Do not treat during flowering to protect pollinators. Note: Nesidiocoris remains a valuable ally in biological control. Damage to fruits is usually limited if its population is well managed. A balance is possible!"
  },
  "Acariose Bronzée": {
    "description": "Bronze mite disease is caused by a microscopic mite (Aculops lycopersici), specific to tomatoes and other solanaceous plants. Invisible to the naked eye, this parasite sucks the sap from leaves and stems, causing a characteristic bronzing of the foliage. It proliferates in warm and dry conditions, especially in sheltered environments (greenhouses, tunnels). Unlike spider mites, it does not produce webs.",
    "symptoms": "The first signs appear on the lower leaves: a metallic bronzing (coppery or grayish reflections) on the upper surface, while the underside becomes gray and fuzzy. The leaves thicken, deform, and eventually dry out and fall. Stems may also show brown streaks and a corky appearance. Unlike other mites, Aculops lycopersici does not cause yellow spots or webs. Fruits are generally not directly affected, but a severe infestation weakens the plant, reducing the harvest. Use a magnifying glass to observe the mites (0.1–0.2 mm): they look like tiny white or translucent worms on the leaf hairs.",
    "prevention": "Preventing bronze mite disease: simple reflexes /n (i) Isolate new plantings: this mite spreads by wind, tools, or clothing. Disinfect greenhouses and equipment between crops. /n (ii) Maintain a high relative humidity (60–70%) by watering the soil or misting the air, as mites dislike humidity. /n (iii) Plant resistant varieties (some hybrid tomatoes are less sensitive). /n (iv) Pair tomatoes with repellent plants like basil or garlic, which disrupt the mites. /n (v) Regularly monitor the foliage, especially in hot and dry weather.",
    "treatment": "What to do in case of infestation? /n (i) Remove affected leaves and burn them to reduce the source of contamination. /n (ii) Release predatory mites (Phytoseiulus persimilis or Amblyseius californicus), available at garden centers. These beneficials are very effective if introduced early. /n (iii) Spray water on the foliage to increase humidity and limit proliferation. /n (iv) As a last resort, use insecticidal soap or neem oil (to be applied in the evening, ensuring thorough coverage of the undersides of the leaves). Avoid chemical acaricides, which promote resistance and kill beneficials. /n (v) Repeat treatments every 5–7 days, as the eggs (invisible) often escape the first intervention. Do not treat in extreme heat to avoid burning the plants."
  },
  "Aleurodes": {
    "description": "Aphids are small white insects (1–2 mm), resembling mini butterflies, that colonize the undersides of leaves. They suck the sap from tomatoes and excrete honeydew, promoting sooty mold. Their rapid reproduction and resistance to treatments make them a formidable pest, especially in greenhouses or sheltered environments. The adults fly away at the slightest touch, revealing their presence.",
    "symptoms": "The first signs are sticky leaves (honeydew) and a general weakening of the plant. The undersides of the leaves harbor flat, translucent larvae, as well as yellowish eggs in circles. The leaves turn yellow, deform, and may fall prematurely. Affected fruits show black spots (sooty mold) or stunted growth. /n Also, watch for ants attracted by the honeydew or white adults that fly away when you shake the plant. In the case of heavy infestation, the tomatoes become weak and vulnerable to diseases. Regularly inspect the undersides of the leaves, their favorite hiding place.",
    "prevention": "Preventing aphids: natural methods / (i) Install yellow sticky traps to capture adults. / (ii) Pair tomatoes with repellent plants (basil, marigolds, calendula). /n (iii) Encourage beneficials: ladybugs, lacewings, and Encarsia formosa (a specific parasitic wasp). /n (iv) Ventilate greenhouses and avoid excess nitrogen, which attracts aphids. /n (v) Use insect nets (fine mesh) to prevent their establishment.",
    "treatment": "What to do in case of infestation? /n (i) Spray black soap (20 g/L) or neem oil (in the evening) to suffocate larvae and eggs. /n (ii) Release Encarsia (available at garden centers): they parasitize the larvae and stop the cycle. /n (iii) Remove heavily infested leaves and burn them. /n (iv) Treat with nettle extract or garlic decoction to repel adults. /n (v) Avoid chemical insecticides, which kill beneficials and promote resistance. Repeat treatments every 5–7 days, alternating methods. In greenhouses, an early release of macroglens (predatory bugs) can prevent attacks. /n Tip: Aphids love heat. Misting water on the leaves disturbs them and reduces their egg-laying. A natural balance is possible with regular monitoring!"
  }
}
